---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.BritishThermalUnitsPerSecond
source: html/cd7cd9d2-cc2d-9475-6155-b610fe551dd4.htm
---
# Autodesk.Revit.DB.UnitTypeId.BritishThermalUnitsPerSecond Property

British thermal units per second.

## Syntax (C#)
```csharp
public static ForgeTypeId BritishThermalUnitsPerSecond { get; }
```